   <div class="row">
        <div class="col-lg-9">
            <h1>196.Delete Duplicate Emails</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Write a SQL query to <strong>delete</strong> all duplicate email entries in a table named <code>person2</code>, keeping only unique emails based on its <i>smallest</i> <b>Id</b>.</p>

<pre>
+----+------------------+
| Id | Email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |
+----+------------------+
Id is the primary key column for this table.
</pre>

<p>For example, after running your query, the above <code>person2</code> table should have the following rows:</p>

<pre>
+----+------------------+
| Id | Email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
+----+------------------+
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("person2", engine)

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [3]:
## Method 1: Select the one we need
query = '''
SELECT a.*
FROM person2 a, person2 b
WHERE a.id < b.id AND a.email <> b.email;
;
'''
pd.read_sql_query(query, engine)

   id             email
0   1  john@example.com
1   2   bob@example.com

In [4]:
## Method 2: Drop the one we do not need
## DELETE the unqualied rows Like
## DELETE a
##      FROM person2 a, person2 b
##      WHERE a.Id < b.Id and a.email = b.email;
      
## SELECT *
## FROM person2;
## Could not run under safe update mode.

## Note:
# Time:  O(n^2)
# Space: O(n)
#### 1. Two way thinking: finding and deleting.